--Просмотр и завершение исполняемых запросов:

--Для того, чтобы получить информацию о запросах, выполнить следующую команду:
--=======================================================================--
SELECT pid, age(query_start, clock_timestamp()), usename, query
FROM pg_stat_activity
WHERE query != '<IDLE>' AND query NOT ILIKE '%pg_stat_activity%'
ORDER BY query_start desc;
--=======================================================================--

--Для того, чтобы остановить конкретный запрос, выполнить следующую команду, с указанием id процесса (pid):
--=======================================================================--
SELECT pg_cancel_backend(procpid);
--=======================================================================--

--Для того, чтобы прекратить работу запроса, выполнить:
--=======================================================================--
SELECT pg_terminate_backend(procpid);
--=======================================================================--
